VOF_Injector/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (0     0     0)
	(0.04  0     0)
	(0.04  0.04  0)
	(0     0.04  0)
	
	(0     0     0.08)
	(0.04  0     0.08)
	(0.04  0.04  0.08)
	(0     0.04  0.08)
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    SideWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (1 5 6 2)
        );
    }
    
	BottomWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );
    }
	
	FrontNBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
	        (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
