VOF_Injector/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    SideWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       46000;
    }
    BottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       47600;
    }
    atmosphere
    {
        type            patch;
        nFaces          400;
        startFace       48000;
    }
    FrontNBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1600;
        startFace       48400;
    }
)

// ************************************************************************* //
