VOF_Injector/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    SideWalls
    {
        type            noSlip;
    }
    BottomWall
    {
        type            codedFixedValue;
		value           uniform (0 0 0);

		// Name of generated boundary condition
		name    UInjection;

		code
		#{
			const scalar t = this->db().time().value();
			
			const scalar Period = 0.015;
			const scalar InjectionTime = 0.002;
			
			//Bubble size and injection speed
			const scalar D      = 0.001;
			const scalar U_inj  = D/InjectionTime;
			
			//Define locations for injection
			const label N_inj = 2;
			vector pt_Inj[N_inj];
			pt_Inj[0] = vector(0.0075,0,0);
			pt_Inj[1] = vector(0.0125,0,0);
			
			
			const fvPatch& boundaryPatch = patch();
			const vectorField& Cf = boundaryPatch.Cf();
			vectorField& U = *this;
			
			//Time since start of injection cycle
			const scalar t_cycle = fmod(t, Period);
			
			forAll(Cf, f)
			{
				U[f] = vector(0,0,0);
				
				//Bubble being injected
				if (t_cycle < InjectionTime)
				{
					const scalar D_base = D*sin( (t_cycle/InjectionTime)*M_PI );
					const scalar x = Cf[f].x();
								
					for (int j = 0; j < N_inj; j++)
					{
						//Inside injection portion of bubble
						if ( pow( (x-pt_Inj[j].x()), 2) <= pow( (D_base/2.0), 2) )
						{ U[f] = vector(0,U_inj,0); }	
					}
				}
			}
		#};
    }

    Atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    FrontNBack
    {
        type            empty;
    }
}


// ************************************************************************* //
