VOF_Injector/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    SideWalls
    {
        type            fixedFluxPressure;
        // value           uniform 0;
    }

    BottomWall
    {
        type            fixedFluxPressure;
        // value           uniform 0;
    }

    Atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
    }

    FrontNBack
    {
        type            empty;
    }
}

// ************************************************************************* //
